struct Constants
{
    static let apiKey = "<your api key>"
    
    static let searchUrl = "https://www.googleapis.com/youtube/v3/search?part=snippet&maxResults=50&key=\(Constants.apiKey)&q="
    
    static let fishType = [
        "マアジ",
        "メバル",
        "スズキ",
        "カサゴ",
        "メジナ",
        "クロダイ",
        "シロギス",
        "アオリイカ",
        "カワハギ",
        "ヒラメ",
        "ブリ",
        "マサバ",
        "マゴチ",
        "アイナメ",
        "イワナ",
        "ブラックバス",
        "ニジマス",
        "マハゼ",
        "ヤマメ",
        "タチウオ"
    ]
    
    static let fishingMethod = [
        "アジング",
        "メバリング",
        "ジギング",
        "メバリング",
        "エギング",
        "穴釣り",
        "磯釣り",
        "ウキ釣り",
        "ウキフカセ釣り",
        "エビ撒き釣り",
        "エレベーター式（泳がせ釣り）",
        "落とし込み釣り",
        "泳がせ釣り",
        "かかり釣り",
        "カゴ釣り",
        "カッタクリ",
        "渓流釣り",
        "探り釣り",
        "サビキ釣り",
        "ダンゴ釣り",
        "チョイ投げ",
        "堤防釣り",
        "テンカラ釣り",
        "胴突き釣り",
        "友釣り",
        "投げ釣り",
        "波止釣り",
        "ビシ釣り",
        "一つテンヤ",
        "フカセ釣り",
        "ぶっこみ釣り",
        "船釣り",
        "フライフィッシング",
        "ヘチ釣り",
        "前打ち釣り",
        "ミャク釣り",
        "ルアーフィッシング"
    ]
}
